## Terraform Plan Results

#### Format Check 🖌 `failure`
#### Initialization ⚙️ `success`
#### Validation 🤖 `success`
#### Plan 📖 `success`

<details><summary>Show Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_bedrockagent_data_source.cvbot_knowledge_base_ds will be created
  + resource "aws_bedrockagent_data_source" "cvbot_knowledge_base_ds" {
      + data_deletion_policy = (known after apply)
      + data_source_id       = (known after apply)
      + id                   = (known after apply)
      + knowledge_base_id    = (known after apply)
      + name                 = "cvbot-knowledge-base-data-source"

      + data_source_configuration {
          + type = "S3"

          + s3_configuration {
              + bucket_arn = "arn:aws:s3:::cvbot-knowledge-base"
            }
        }

      + vector_ingestion_configuration {
          + chunking_configuration {
              + chunking_strategy = "NONE"
            }
        }
    }

  # aws_bedrockagent_knowledge_base.cvbot_knowledge_base will be created
  + resource "aws_bedrockagent_knowledge_base" "cvbot_knowledge_base" {
      + arn             = (known after apply)
      + created_at      = (known after apply)
      + failure_reasons = (known after apply)
      + id              = (known after apply)
      + name            = "cvbot-s3-knowledge-base"
      + role_arn        = "arn:aws:iam::097890748571:role/service-role/CvbotKnowledgeBaseRole"
      + tags_all        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "CVBot"
        }
      + updated_at      = (known after apply)

      + knowledge_base_configuration {
          + type = "VECTOR"

          + vector_knowledge_base_configuration {
              + embedding_model_arn = "arn:aws:bedrock:us-west-2::foundation-model/amazon.titan-embed-text-v1"

              + embedding_model_configuration {
                  + bedrock_embedding_model_configuration {
                      + embedding_data_type = "FLOAT32"
                    }
                }
            }
        }

      + storage_configuration {
          + type = "S3_VECTORS"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @andrewjacksonio, Action: `pull_request`, Workflow: `Terraform Plan`*